"(Not You?)|Login - Clickable text letting user log in as a different user" = "(Bukan Anda?)";

"+%i|Very short string used in place of X names of members of a thread (when the thread name is too long to fit). Ex: +1, +2, +3.  If the language has no short way to express this, use … (ellipsis) or equivalent." = "+%1$i";

",|Punctuation (comma) used to separate entries in a list of names. Example: Alice, Bob, Carol" = ",";

"1 Friend Nearby|Title of mini-megaphone inside chat bar." = "1 Rakan Berdekatan";

"1 day|text to show user was online/active 1 day ago (don't abbrev)" = "1 hari";

"1 hour|text to show user was online/active 1 hour ago (don't abbrev)" = "1 jam";

"1 minute|text to show user was online/active 1 minute ago (don't abbrev)" = "1 minit";

"1d|short indicator that a user was active 1 day ago" = "1h";

"1h|short indicator that a user was active 1 hour ago" = "1j";

"1m Limit: Release to send|notify user that the maximum recording time has been reached" = "Had 1 minit: Lepaskan untuk hantar";

"1m|short indicator that a user was active 1 minute ago" = "1m";

"2 days|text to show user was online/active 2 days ago (don't abbrev)" = "2 hari";

"2 hours|text to show user was online/active 2 hours ago (don't abbrev)" = "2 jam";

"2 minutes|text to show user was online/active 2 minutes ago (don't abbrev)" = "2 minit";

"A new version of Messenger is available.|New version title" = "Versi baru Messenger tersedia.";

"Activation Code|placeholder text for activation code field" = "Kod Pengaktifan";

"Activation Request Failed|" = "Permintaan Pengaktifan Gagal";

"Active Now (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "Aktif Sekarang (%1$d)";

"Add Favorite|Title of screen shown when user is adding a new favorite" = "Tambah Kegemaran";

"Add More People|button for adding people to the conversation" = "Tambah Lagi Orang";

"Add More People|title for add members page" = "Tambah Lagi Orang";

"Add More People|title for add people page" = "Tambah Lagi Orang";

"Add People|button to add members to the message thread" = "Tambah Orang";

"Add Photos|Button label for adding photos from the photo library" = "Tambah Foto";

"Add to Existing Contact|action sheet option for adding a phone number to an existing contact" = "Tambah ke Kenalan Sedia Ada";

"Adding...|adding progress text" = "Menambah...";

"Advanced Settings|text for advanced settings button" = "Tetapan Lanjutan";

"Advanced|title for advanced settings page" = "Lanjutan";

"Alerts Off Until %@|Indicates that alerts are off until X time" = "Awasan Dimatikan Sehingga %1$@";

"Alerts Off for 1 Hour|Indicates that alerts are off for 1 hour" = "Awasan Dimatikan selama 1 Jam";

"Alerts Off|Indicates that alerts are off" = "Awasan Dimatikan";

"Alerts On|Indicates that alerts are on" = "Awasan Dihidupkan";

"All notifications are off for 8h.|footer text for notifications settings applying to all conversations" = "Semua pemberitahuan dimatikan untuk 8j";

"All notifications are off.|Mute warning display on thread list" = "Semua pemberitahuan dimatikan.";

"All|Segment button label for all stickers" = "Semua";

"Answer|Text for button that accepts a call" = "Jawab";

"Archive|Button label that will archive the conversation" = "Arkib";

"Archive|Label for archive button when swipe to archive in thread list view" = "Arkib";

"Are you sure you want to delete the conversation name?|alert message for deleting conversation name" = "Anda pasti hendak memadamkan nama perbualan?";

"Are you sure you want to leave this conversation? You will no longer receive new messages.|confirmation dialog message for leaving a thread" = "Anda pasti hendak meninggalkan perbualan ini? Anda tidak lagi akan menerima mesej baru.";

"Are you sure?|Title for dialog asking the user if they're sure if they want to not enable push notifications" = "Adakah anda pasti?";

"Attach a Photo|Button label for attaching a photo from the photo library" = "Lampirkan Foto";

"Attach media|Accessibility text for button that lets user start attaching photos or other media, as well as emoticons and emoji" = "Lampirkan media";

"Back|Go back to previous screen" = "Balik";

"Back|generic nav bar back button" = "Kembali";

"Background task expired|Error string for app killed in background while message was sending" = "Tugas latar belakang tamat tempoh";

"Bing Image Search|" = "Carian Imej Bing";

"Blast to at most %i people at a time.|dialog message for when the user tries to select too many recipients for a blast message. A blast message goes to multiple individual recipients who cannot reply-all." = "Sebarkan kepada maksimum %1$i orang pada satu-satu masa.";

"Blast|Button for starting a blast (broadcast) message. A blast message goes to multiple individual recipients who cannot reply-all." = "Sebar";

"Blast|Title of the blast (broadcast) composer screen. A blast message goes to multiple individual recipients who cannot reply-all." = "Sebar";

"Blasts can contain up to %i attachments.|dialog message for when the user tries to add too many (>5) attachments to a message" = "Sebaran boleh mengandungi sehingga %1$i lampiran.";

"Bring messages to life|Title of Media attachment NUX" = "Hidupkan mesej";

"Broadcast|Button for starting a broadcast message. A broadcast message goes to multiple individual recipients who cannot reply-all." = "Siaran";

"Broadcast|Title of the broadcast composer screen. A broadcast message goes to multiple individual recipients who cannot reply-all." = "Siaran";

"Call Ended|End call message in non-error case" = "Panggilan Tamat";

"Call Ended|String shown when the call ends" = "Panggilan Tamat";

"Call Failed|End call message in error case" = "Panggilan Gagal Disambung";

"Call friends over your Wi-Fi connection or mobile network. Normal data rates apply.|Warning about data usage" = "Panggil rakan melalui sambungan Wi-Fi atau rangkaian mudah alih anda. Kadar data biasa digunakan.";

"Call %@|action sheet option for calling a phone number" = "Panggil %1$@";

"Call|Call" = "Panggil";

"Calls are free over Wi-Fi. Standard charges apply for calls over a mobile network.|Alert message that warns users their mobile carrier may charge them for making VOIP calls" = "Panggilan adalah percuma melalui Wi-Fi. Caj standard digunakan untuk panggilan melalui rangkaian mudah alih.";

"Camera|Button label for attaching a photo from the camera" = "Kamera";

"Cancel|Title for generic Cancel button." = "Batal";

"Celebrations|Title of list of friends who have events to celebrate." = "Sambutan";

"Chat with any contact or number on your phone without any costs.|Explanation of why one should use the contact importer" = "Berbual dengan mana-mana kenalan atau nombor pada telefon anda tanpa sebarang kos.";

"Chat|The title of the view showing the buddy list section of the app" = "Bual";

"Choose Friends|Button title for adding friends to the broadcast recipients list." = "Pilih Rakan";

"Choose Photo|action sheet option for choosing a photo from photo library" = "Pilih Foto";

"Clear|prompt to clear all unsent messages" = "Kosongkan";

"Clearing...|Progress text shown while clearing the image for a thread" = "Mengosongkan...";

"Close active chat|Button to close an active chat" = "Tutup perbualan aktif";

"Close|Title of button in navigation bar to close a web page." = "Tutup";

"Closes settings|Accessibility hint for \"Done\" button, tapping on it will close the settings panel" = "Menutup tetapan";

"Comment|Comment button title" = "Komen";

"Compose message to %@|Accessibility label describing a text view to start writing a message to a user with no draft message" = "Karang mesej kepada %1$@";

"Compose message to %@: %@|Accessibility label describing a text view to start writing a message to a user with some appended draft message" = "Karang  mesej kepada %1$@: %2$@";

"Confirm Phone|Title of page where user enters their phone number" = "Sahkan Telefon";

"Connecting|Text shown on call screen while connecting a call" = "Menyambung";

"Connection Failed|Alert title when connection failed" = "Sambungan Gagal";

"Connection Lost|End call message in connection lost case" = "Sambungan Terputus";

"Contact Info|AXLabel for button to go from Message to Recipient's contact info." = "Maklumat Hubungan";

"Contact Info|Title of the canonical thread info page." = "Maklumat Hubungan";

"Continue and Don't Ask Again|Button label to not ask for permission again before continuing through a zero rating session fence" = "Teruskan dan Jangan Tanya Lagi";

"Continue|Button label to continue through zero rating session fence" = "Teruskan";

"Continue|Login - Login Button Title for Keychain Login" = "Teruskan";

"Conversation Name|placeholder text in conversation name textfield" = "Nama Perbualan";

"Copy|Option that pops out after long press on a link/phone no./address in message thread." = "Salin";

"Copy|Title for buttons and menus that let user copy the current text" = "Salin";

"Copy|action sheet option for copying a string to the clipboard" = "Salin";

"Could not add new members. Please try again.|message for failing to add members dialog" = "Tidak dapat menambah ahli baru. Sila cuba lagi.";

"Could not load sticker store.|Error message for sticker store load failure" = "Tidak dapat memuatkan stor pelekat.";

"Could not retrieve availability|Text shown to an user when the operation to retrieve the other party's callable status fails" = "Tidak berjaya mendapatkan ketersediaan";

"Countries|Title for country picker" = "Negara";

"Country|Country - Country placeholder text" = "Negara";

"Create Group Chat|Label for a button that creates a new group chat" = "Cipta Perbualan Kumpulan";

"Create Group Chat...|Text on a button to compose a new group message" = "Cipta Perbualan Kumpulan...";

"Create Group Conversation|button for adding people to the canonical conversation" = "Buat Perbualan Kumpulan";

"Create New Contact|action sheet option for creating a new contact" = "Buat Kenalan Baru";

"Currently in a call|Error message when user tries to initiate a call while already in a call" = "Sedang dalam panggilan";

"Customize Notification Settings|User education for how to configure conversation alerts" = "Suaikan Tetapan Pemberitahuan";

"Decline|Text for button that declines a call" = "Menolak";

"Delete Conversation Name|alert title for deleting conversation name" = "Padam Nama Perbualan";

"Delete Conversation|Button label that will delete the conversation" = "Padam Perbualan";

"Delete Message? It cannot be undone.|text shown when a user swipes to delete a message" = "Padam Mesej? Langkah ini tidak akan dapat diundur semula.";

"Delete This Entire Conversation?|Title for the Confirm alert box asking the user if they want to delete a conversation." = "Padam Keseluruhan Percakapan Ini?";

"Delete|Button label that will delete the conversation" = "Padam";

"Delete|Button to accept deleting the name of a conversation" = "Padam";

"Delete|Label for archive button when swipe to archive in thread list view" = "Padam";

"Delete|Label for button to delete previous character" = "Padam";

"Delete|Label on button that deletes a thread" = "Padam";

"Delete|button text for deleting a message" = "Padam";

"Delete|button text for removing an unsent message" = "Padam";

"Details|title for message details page" = "Butiran";

"Discover Who's Nearby|Title of NUX to encourage user to use location services." = "Ketahui Siapa yang Berada Berdekatan";

"Don't Delete|Button to decline to delete the name of a conversation" = "Jangan Padam";

"Don't Save|Don't save action sheet button" = "Jangan Simpan";

"Done editing message list|Accessibility label for button that ends editing of the messages list" = "Selesai mengedit senarai mesej";

"Done|Title for generic Done button that dismisses a view. This needs to be a short string to avoid truncation." = "Selesai";

"Double-tap to edit|Accessibility hint for FAVORITES header in Chat friend list" = "Dwiketik untuk edit";

"Download Failed|Title in alert view when downloading a sticker pack has failed" = "Muat Turun Gagal";

"Download|Accessibility label for download button in sticker store list view" = "Muat Turun";

"Download|Button title to download an upgrade" = "Muat Turun";

"Download|Label for button to download a sticker pack" = "Muat turun";

"Downloaded|Accessibility label for downloaded icon in sticker store list view" = "Dimuat turun";

"Downloaded|Label for button to show a sticker pack has been downloaded" = "Dimuat turun";

"Downloading|Accessibility label for download button in sticker store list view when downloading" = "Memuat turun";

"Downloading|Label for button to show a sticker pack being downloaded" = "Memuat turun";

"Drag Down to Hide|Chat head dismiss NUX title" = "Seret Ke Bawah untuk Menyembunyikannya";

"Drag here to hide|instructions for user to drag a chat head to hide it" = "Seret ke sini untuk menyembunyikannya";

"Edit|Edit button/label title for chat divebar" = "Edit";

"Email or phone number|email/phone field placeholder on login screen" = "E-mel atau nombor telefon";

"Empty Feedback|Title for empty feedback warning." = "Maklum Balas Kosong";

"Enable|Enable Message Anyone, keep it short, 14 chars max" = "Mendayakan";

"Enter Code|Enter Code page title" = "Masukkan Kod";

"Error|Error title for sticker pack detail view" = "Ralat";

"Error|error title after failed to load webview" = "Ralat";

"FREE|Price label for free sticker pack" = "PERCUMA";

"Facebook Is Better With Location|Title of NUX to encourage user to use location services." = "Facebook Adalah Lebih Baik Dengan Lokasi";

"Facebook Messenger Login|Accessibility label for header of messenger login view" = "Log Masuk Facebook Messenger";

"Facebook User|Placeholder name for Facebook user whose name is unknown" = "Pengguna Facebook";

"Facebook stores contacts on your behalf and may use them to help others to search for or connect with people, or to generate suggestions for you or others. You can edit this information by tapping the \"i\" button in a conversation, or delete all your contacts in your app settings.|Detailed explanation of the contact sync feature on the Learn More screen" = "Facebook menyimpan kenalan bagi pihak anda dan mungkin menggunakannya untuk membantu yang lain mencari atau berhubung dengan orang atau untuk menjana cadangan untuk anda atau pengguna lain. Anda boleh menyunting maklumat ini dengan mengetik butang \"i\" dalam perbualan atau padam semua kenalan dalam tetapan aplikasi anda.";

"Facebook will periodically use and store your location.|Explanation to let user know Facebook will periodically use and store his location." = "Facebook akan menyimpan dan menggunakan lokasi anda dari semasa ke semasa.";

"Failed to add members|title for failing to add members dialog" = "Gagal menambah ahli";

"Failed to save your settings.|error message after changing thread alert setting." = "Gagal menyimpan tetapan anda.";

"Favorites|chat bar favorites header title" = "Kegemaran";

"Featured|Segment button label for featured stickers" = "Ditampilkan";

"Follow these steps to use Facebook's location features.|Explanation to let user know he can turn on location services by following the listed steps." = "Ikuti langkah berikut untuk menggunakan ciri lokasi Facebook.";

"Follow|Title for button allowing users to follow the profile they are currently viewing" = "Ikuti";

"For more accurate results, go to %@ settings and choose Location Services. Select ON for %@.|Error explanation when location services are unavailable, and user gets better results with them on. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "Untuk keputusan yang lebih tepat, pergi ke tetapan %1$@ dan pilih Perkhidmatan Lokasi. Pilih HIDUP bagi %2$@.";

"For more accurate results, go to %@ settings and tap Privacy, then Location Services. Select ON for %@.|Error explanation when location services are unavailable, and user gets better results with them on. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "Untuk keputusan yang lebih tepat, pergi ke tetapan %1$@ dan ketik Privasi, kemudian Perkhidmatan Lokasi. Pilih HIDUP bagi %2$@.";

"Free Call|Text on button that starts a messenger call" = "Panggilan Percuma";

"Free Calling Unavailable|Title for dialog explaining that messenger calls are not available" = "Panggilan Percuma Tidak Tersedia";

"Friends Nearby|Title of list of friends who are nearby." = "Rakan Berhampiran";

"Friends on Messenger|Table title: Friends who have Facebook Messenger" = "Rakan di Messenger";

"Get Directions|action sheet option for viewing a map" = "Dapatkan Arah";

"Get Facebook Messenger|The title for messenger promotion banner" = "Dapatkan Facebook Messenger";

"Get Started|Label for a button that creates a new group chat" = "Mulakan";

"Get Started|Title for NUX" = "Bermula";

"Give us feedback or report a problem|Placeholder text for the report bug or feedback input field" = "Berikan kami maklum balas atau laporkan masalah";

"Google Image Search|" = "Carian Imej Google";

"Group Chat|Title for megaphone section helping users discover group chats" = "Perbualan Kumpulan";

"Group Chats|Title for megaphone section helping users discover group chats" = "Perbualan Kumpulan";

"Group Chats|chat bar header for group conversations" = "Perbualan Kumpulan";

"Group Conversation|Label at top of online friends list that takes user to new message composer" = "Perbualan Kumpulan";

"Group Conversations|Table header for group threads section" = "Perbualan Kumpulan";

"Group Info|Title of group thread info page." = "Maklumat Kumpulan";

"Group Members|Title for section showing members of a group (member count will follow)" = "Ahli Kumpulan";

"Group Messages|Title for megaphone section helping users discover group chats" = "Mesej Kumpulan";

"Group|Button for starting a new group message." = "Kumpulan";

"Have a conversation with a bunch of friends at a time.|Body text for megaphone encourgaging users to try group chats" = "Berbual dengan sekumpulan rakan pada waktu tersebut.";

"Help|text for help button" = "Bantuan";

"Hold to Talk|The instruction for holding the record button and talk" = "Tahan untuk Bercakap";

"I'm sure|Button label confirming the user wants to continue with the selected action" = "Saya pasti";

"If you enjoy using %@, would you mind taking a moment to rate this update? Thanks!|Prompt for user to rate the app." = "Jika anda seronok menggunakan %1$@, sudikah anda ambil sedikit masa untuk menilai kemas kini ini? Terima kasih!";

"Image Search|action sheet option for choosing a photo from image search" = "Carian Imej";

"Include your location|Title of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Masukkan lokasi anda";

"Incorrect Confirmation Code.|alert title for incorrect confirmation code" = "Kod Pengesahan Salah.";

"Install Facebook Messenger?|The caption to promote users for installing Facebook Messenger app" = "Pasang Facebook Messenger?";

"Install|Button text to install the Facebook Messenger" = "Pasang";

"Install|The text on the button for users to install Messenger." = "Pasang";

"Introducing Chat Heads|Chat head intro NUX title" = "Memperkenalkan Imej Perbualan";

"Invalid Country Code|alert title for invalid country code" = "Kod Negara Tidak Sah";

"Invalid Phone Number|alert title for invalid phone number" = "Nombor Telefon Tidak Sah";

"Just tap to open and close your messages.|Chat head intro NUX body" = "Hanya ketik untuk buka dan tutup mesej anda.";

"Keep everyone in the loop|Detail subtitle for Group Chat NUX slide" = "Beri makluman kepada semua orang";

"Last Updated: %@|last updated date in pull to refresh header" = "Kemas kini terakhir: %1$@";

"Learn More|Default action text for more info link on the zero rating promotion banner view at the bottom of screen." = "Pelajari Lebih Lanjut";

"Learn More|Learn More about Message Anyone, keep it short, 14 chars max" = "Pelajari Lebih Lanjut";

"Leave Conversation|leave conversation button" = "Tinggalkan Perbualan";

"Leave conversation?|confirmation dialog title for leaving a thread" = "Tinggalkan perbualan?";

"Leave|Button title for leaving a thread" = "Tinggalkan";

"Leaving...|Progress text shown while leaving a thread" = "Meninggalkan...";

"Let people in this conversation know where you are.|Text of location NUX when user has not yet made a choice regarding enabling or disabling location services." = "Maklumkan orang dalam perbualan ini di mana anda berada.";

"Licenses|Licenses screen title" = "Lesen";

"Licenses|text for licenses button" = "Lesen";

"Like|Like button title" = "Suka";

"Like|Title for generic Like button." = "Suka";

"Load Map|Button text for users to load the map location when zero rated." = "Muatkan Peta";

"Loading...|Message presented while waiting for content to load." = "Memuatkan...";

"Loading...|Placeholder text while results are loading" = "Memuatkan...";

"Locating You...|Message presented when waiting for an accurate location fix." = "Mencari Lokasi Anda...";

"Location is Disabled|Title for dialog indicating that the app hasn't been granted location permissions" = "Lokasi Dinyahdayakan";

"Location is off for this conversation|Title of location NUX when user turns off location services for the first time." = "Lokasi dimatikan bagi perbualan ini.";

"Location services are off. Turn on to let people in this conversation know where you are.|Text of location NUX when user has disabled location services." = "Perkhidmatan lokasi dimatikan. Hidupkan untuk memberitahu orang dalam perbualan ini di mana anda berada.";

"Location services are on|Title of location NUX when user has enabled location services." = "Perkhidmatan Lokasi dihidupkan";

"Log In to Facebook|Login - Login Button Title for password login" = "Log Masuk ke Facebook";

"Logged in as %@|Login - Text showing who user is logged in as" = "Dilog masuk sebagai %1$@";

"Login Approval Required|title of login approval dialog" = "Kelulusan Log Masuk Diperlukan";

"Login Failed|Invalid login alert title" = "Log Masuk Gagal";

"Logs in as someone else|Accessibility hint for \"Not You?\" link on the login page, letting the user log in as some one else" = "Log masuk sebagai individu lain";

"Logs in as %@|Accessibility hint for the \"Continue\" button on the login screen, which lets the user log in using the system Facebook account with one tap" = "Log masuk sebagai %1$@";

"Logs in to another account|Accessibility hint for \"Switch Account\", which lets users to log out or log in with another account" = "Log masuk ke dalam akaun lain";

"Mark as Unread|Button label that will mark the thread as unread" = "Tanda sebagai Belum Dibaca";

"Meep|Name for Meep sticker pack" = "Meep";

"Message Anyone|Call to action to use contact importer in divebar" = "Mesej Sesiapa";

"Message friends|Accessibility label for button that toggles display of friends list/search" = "Mesej rakan";

"Message|Button for starting a new message." = "Mesej";

"Message|button to open a composer to send a message to the page" = "Mesej";

"Messages|Messenger module display name" = "Pesanan";

"Messages|The title of the message thread list view." = "Mesej";

"Messages|Title for messages inbox view" = "Mesej";

"Messages|accessibility (voiceover) label for chathead inbox" = "Mesej";

"Messages|name of the app with Facebook brand" = "Mesej";

"Messenger regularly syncs your contacts to help you reach more people and connect friends|Explanation of the contact sync feature on the Learn More screen" = "Messenger menyegerakkan kenalan anda secara kerap untuk membantu anda mencapai lebih ramai orang dan menghubungkan rakan";

"Messenger|The title of the app, used in Appirater's dialog." = "Messenger";

"More Friends (%d)|Title for chat bar section containing friends who are not top friends. Number after string is number of friends who are online or pushable." = "Lebih Ramai Rakan %1$d";

"More Friends (%d)|Title for chat bar section containing online friends who are not top friends. Number after string is number of friends who are online." = "Lebih Ramai Rakan %1$d";

"More Online Friends|Table title: More friends who are online (but are not top ranked friends)" = "Lebih Rakan Di Talian";

"Name is Too Long|alert title for long conversation name" = "Nama Terlalu Panjang";

"Name this conversation|placeholder text for the prompt to name a conversation" = "Namakan perbualan ini";

"Nearby|Nearby people to send a message to" = "Berhampiran";

"Never miss a message again|Detail subtitle for Push Notification NUX slide" = "Mesej anda tidak akan terlepas lagi.";

"Never miss a message from your friends again.|Body of Messenger NUX page 2" = "Tidak lagi terlepas mesej daripada rakan anda.";

"New Message|Text on a button in messages popover to compose a new message" = "Mesej Baru";

"New Message|Title of screen shown when user is composing a new message" = "Mesej Baru";

"New version available|Title of alert displayed when new version is available" = "Versi baru tersedia";

"Next|Generic button to move to next item" = "Seterusnya";

"Next|button label for moving to the next screen" = "Seterusnya";

"No Internet Connection|Warning banner for no network connection" = "Tiada Sambungan Internet";

"No Message|dialog title for when user tries to send an empty message" = "Tiada Mesej";

"No Participants|String to display in table cell when no participants are on the thread because everyone has left the conversation" = "Tiada Peserta";

"No Participants|String when no participants are on the thread" = "Tiada Peserta";

"No Recipients|dialog title for when user tries to send to no recipients" = "Tiada Penerima";

"No Results|Alert title when there are no results from image search." = "Tiada Keputusan";

"No locations shared recently.|message on map view when no location has been shared recently" = "Tiada lokasi dikongsikan baru-baru ini.";

"No response.|Error reported when no response is received from the server" = "Tiada respons.";

"No, Thanks|Label on button for user to decline to rate the app" = "Tidak, Terima kasih";

"Not Now|Button text to temporarily ignore the installation message" = "Bukan Sekarang";

"Not Now|Do not enable contact sync button label, 15 char max" = "Bukan Sekarang";

"Not Now|Not now alert popup button" = "Bukan Sekarang";

"Not Now|Title of button to not share location for now." = "Bukan Sekarang";

"Not Now|button label for deferring enabling push notifications" = "Bukan Sekarang";

"Not now|Button title to decline an upgrade" = "Bukan sekarang";

"Notifications are turned off for 8 hours|Accessibility announcement for turning off messenger notifications for 8 hours" = "Pemberitahuan akan dimatikan untuk 8 jam";

"Notifications are turned on|Accessibility announcement for turning on messenger notifications" = "Pemberitahuan dihidupkan";

"Notifications for This Conversation|Title for per-thread notification settings" = "Pemberitahuan untuk Perbualan Ini";

"Notifications for this conversation are off.|Mute warning display on conversation view" = "Pemberitahuan untuk perbualan ini dimatikan.";

"Notifications|Label for enabling/disabling notification" = "Makluman";

"Notifications|Label for enabling/disabling notifications" = "Pemberitahuan";

"OK|Title for generic OK button." = "OK";

"Off Until %@|Short string for indicating that alerts are off until X time" = "Dimatikan Sehingga %1$@";

"Off for 1 Hour|Short string for indicating that alerts are off for 1 hour" = "Dimatikan selama 1 Jam";

"Off|Short string for indicating that alerts are off" = "Dimatikan";

"On|Short string for indicating that alerts are on" = "Dihidupkan";

"Once you delete your copy of the conversation, it cannot be undone.|Message body for the Confirm alert box asking the user if they want to delete a conversation." = "Setelah anda memadam salinan perbualan anda, ia tidak boleh dibatalkan.";

"Only You|String for describing a thread where you are the only user remaining" = "Hanya Anda";

"Open iPhone Settings|One of a sequence of steps instructing user to turn on location services." = "Buka Tetapan iPhone";

"Open in Maps|action sheet option for opening an address in the Maps app" = "Buka dalam Peta";

"Open sticker store|Accessibility label for sticker store tab bar button" = "Buka stor pelekat";

"Other People|Table section header for a list of non-friend search results" = "Orang Lain";

"Password|password field placeholder on login screen" = "Kata Laluan";

"People in this conversation can see your location on the map.|Text of location NUX when user has enabled location services." = "Orang dalam perbualan ini boleh melihat lokasi anda di dalam peta.";

"People you add will see all previous messages in this conversation.|warning when adding new people to a thread" = "Orang yang anda tambah akan dapat melihat semua mesej terdahulu dalam perbualan.";

"Phone Number|placeholder text for phone number field" = "Nombor Telefon";

"Pin friends you message most|Label when users have no favorites" = "Pin rakan yang paling sering anda mesej";

"Please check your confirmation code and try again.|alert message for incorrect confirmation code" = "Sila semak kod pengesahan anda dan cuba lagi.";

"Please check your network connection and try again.|" = "Sila semak sambungan rangkaian anda dan cuba lagi.";

"Please check your number and try again.|Error reported when an invalid phone number response is received from the server" = "Sila semak nombor anda dan cuba lagi.";

"Please check your number and try again.|alert message for invalid phone number" = "Sila semak nombor anda dan cuba lagi.";

"Please download the latest version of Facebook Messenger.|Notification displayed to user when a version upgrade is available" = "Sila muat turun versi terkini Facebook Messenger.";

"Please enter a message or attach a photo|dialog message for when user tries to send an empty message" = "Sila masukkan mesej atau lampirkan foto";

"Please enter a valid country code.|alert message for invalid country code" = "Sila masukkan kod negara yang sah.";

"Please enter the email and password you use to log in to Facebook.|Invalid login alert message" = "Sila masukkan e-mel dan kata laluan yang anda gunakan untuk mengelog masuk ke Facebook.";

"Please include a description of your problem.|Message for empty feedback warning." = "Sila masukkan penerangan masalah anda.";

"Please rate the quality of your call|Prompt for call quality survey" = "Sila nilaikan kualiti panggilan anda";

"Please re-login to renew your session.|Error message for expired session" = "Sila log masuk semula untuk memperbaharui sesi anda.";

"Please try again|Alert message when there are no results from image search." = "Sila cuba lagi";

"Please use a shorter conversation name.|alert message for long conversation name" = "Sila gunakan nama perbualan yang lebih pendek.";

"Privacy & Terms|text for privacy and terms button" = "Privasi & Terma";

"Pull Chat Heads down to the Ⓧ to hide them.|Chat head dismiss NUX body" = "Tarik Imej Perbualan bawah ke Ⓧ untuk menyembunyikannya.";

"Pull down to refresh...|message for pull down to refresh" = "Tarik turun untuk segar semula...";

"Push notification alerts are off.|Notice that push notifications are turned off" = "Isyarat pemberitahuan push dimatikan.";

"Push notification alerts are off.|Reminder text for when push alerts are off on the phone." = "Awasan pemberitahuan tolak dimatikan.";

"Push notification sounds are off.|Reminder text for when push notification sounds are off on the phone." = "Bunyi pemberitahuan tolak dimatikan.";

"Push notifications are off.|Reminder text for when push notifications are off on the phone." = "Makluman tolak dimatikan.";

"Push up to refresh...|message for push up to refresh" = "Tolak ke atas untuk segar semula...";

"Pusheen|Name for Pusheen sticker pack" = "Pusheen";

"Quickly find your group chats here.|Body text for megaphone encourgaging users to try group chats" = "Cari perbualan kumpulan anda dengan pantas di sini.";

"Quickly find your group messages here.|Body text for megaphone encourgaging users to try group chats" = "Cari mesej kumpulan anda dengan pantas di sini.";

"Rate %@|Alert title for asking user to rate this app." = "Nilaikan %1$@";

"Rate %@|Label on button prompting user to rate the app." = "Nilai %1$@";

"Reach friends wherever they are now — mobile or web.|Body of Messenger NUX page 1" = "Capai  rakan di mana saja mereka berada sekarang — mudah alih atau web.";

"Reach friends wherever they are now|Detail subtitle for Cross Platform NUX slide" = "Hubungi rakan-rakan di mana sahaja mereka berada";

"Recent Stickers|Accessibility label for recently used stickers" = "Pelekat Baru";

"Recent Stickers|Label shown in recent stickers tab when no recent stickers exist." = "Pelekat Terkini";

"Record Video|action sheet option for recording a video" = "Rakam Video";

"Record Voice|Button label for attaching an audio clip" = "Rekod Suara";

"Recorder failed to start|Error info for users saying the audio recorder failed to start." = "Perekod gagal bermula";

"Recording cancelled|Notify user that the recording has been successfully cancelled." = "Rakaman dibatalkan";

"Release to cancel recording|The instruction to user: release the record button to cancel the recording." = "Lepaskan untuk batalkan rakaman";

"Release to refresh...|message for releasing to refresh" = "Lepaskan untuk segar semula...";

"Remind Me Later|Label on button allowing the user to postpone rating the app." = "Ingatkan Saya Kemudian";

"Remove Attachment|action sheet option for removing current attachment" = "Keluarkan Lampiran";

"Remove Photo|action sheet option for removing chosen photo" = "Keluarkan Gambar";

"Remove Photo|action sheet option for removing current attachment" = "Keluarkan Gambar";

"Removing...|text for removing progress" = "Mengeluarkan...";

"Report a Problem|title for give feedback or report bug" = "Laporkan Masalah";

"Resend|Resend - Resend Button Title" = "Hantar semula";

"Retry|generic retry button" = "Cuba semula";

"Ringing|Text shown on call screen while contacting another party" = "Berdering";

"Save Photo|action sheet option to save photo to library" = "Simpan Foto";

"Save photo as conversation image?|" = "Simpan foto sebagai imej perbualan?";

"Save|" = "Simpan";

"Saving...|Progress text shown while saving a new image for a thread" = "Menyimpan…";

"Saving...|Progress text shown while saving a new name for a thread" = "Menyimpan…";

"Search for More Friends…|Label at bottom of online friends list that lets user search for more friends" = "Cari lebih Ramai Rakan…";

"Search to add favorites|placeholder in edit favorites search bar" = "Cari untuk tambah kegemaran";

"Search|placeholder in search bar" = "Cari";

"Searching...|Placeholder text in a search results list that indicates a contact search is ongoing" = "Sedang Mencari...";

"See Group Chats|Label for a button that creates a new group chat" = "Lihat Perbualan Kumpulan";

"See where friends are hanging out and share your location with them. They won't see exactly where you are.|Description of NUX to encourage user to use location services." = "Lihat di mana rakan anda sedang berada dan kongsi lokasi anda dengan mereka. Mereka tidak akan melihat di mana anda berada.";

"Seen by Everyone|Seen state text for when everyone has seen the message." = "Dilihat oleh Semua Orang";

"Seen by everyone|Seen state text for when everyone has seen the message." = "Dilihat oleh semua orang";

"Seen by %@ %@|Text for when a message has been seen by 1 person at a certain time or date/time. eg. (Seen by <name> <time>)" = "Dilihat oleh %1$@ %2$@";

"Seen by %@|Text for when a message has been seen by 1 person" = "Dilihat oleh %1$@";

"Seen by %@|Text for when a message has been seen by more than 1 person" = "Dilihat oleh %1$@";

"Seen by:|Text for seen state header" = "Dilihat oleh:";

"Seen %@ near %@|Text for when a message has been sen at a certain time (or date/time) and location e.g. (Seen 3:33 PM near Palo Alto)" = "Dilihat %1$@ berdekatan %2$@";

"Seen %@|Text for when a message has been seen at a certain time or date/time. eg. (Seen 3:33PM) or (Seen Mon 3:33PM)" = "Dilihat %1$@";

"Select country code|select country code text" = "Pilih kod negara";

"Send (%i)|Send button with count in parentheses" = "Hantar (%1$i)";

"Send Failure|dialog title for when a broadcast message fails" = "Hantaran Gagal";

"Send in Message|Sharing option" = "Hantar dalam Mesej";

"Send to Phone, Chat and Web|Call to action for Cross Platform NUX slide" = "Hantar ke Telefon, Ruangan Sembang dan Web";

"Send|Nav bar send button text" = "Hantar";

"Send|Send button" = "Hantar";

"Send|text to show in the send button" = "Hantar";

"Sending...|sending progress text" = "Menghantar...";

"Sending…|Text used below message bubble to show send is in progress" = "Menghantar...";

"Sent a message|default notification text for messages with no body text" = "Hantar mesej";

"Sent from Messenger|indicator that a message was sent from Messenger" = "Dihantar dari Messenger";

"Sent from email|indicator that a message was sent from email" = "Dihantar dari e-mel";

"Sent from mobile|indicator that a message was sent sent from a mobile device" = "Dihantar dari mudah alih";

"Sent from web|indicator that a message was sent sent from web or chat" = "Dihantar dari web";

"Sent from %@|Text used for showing the location where a message was sent from. e.g (city) or (city, state) or (city, country)." = "Dihantar daripada %1$@";

"Sent %@|Text used for showing that a message has been successfully sent to the server. eg. (Published <time>)." = "Dihantar %1$@";

"Session Expired|Error title for expired session" = "Sesi Tamat Tempoh";

"Set Facebook to ON|One of a sequence of steps instructing user to turn on location services." = "Set Facebook kepada HIDUP";

"Settings App > General > Location Services|Location of Location Services Settings page for before 4.3." = "Aplikasi Tetapan > Umum > Perkhidmatan Lokasi";

"Settings App > Location Services|Location of Location Services Settings page for 4.3 or later." = "Aplikasi Tetapan > Perkhidmatan Lokasi";

"Settings App > Privacy > Location Services|Location of Location Services Settings page for 6.0 or later." = "Tetapan Aplikasi › Privasi › Perkhidmatan Lokasi";

"Settings|Accessibility label for a gear button that shows settings for chat" = "Tetapan";

"Settings|Settings alert popup button" = "Tetapan";

"Settings|title for settings page" = "Tetapan";

"Share your location to see who.|Subtitle of mini-megaphone inside chat bar. User can see which friends are nearby after sharing his own location." = "Kongsi lokasi anda untuk melihat siapa.";

"Share|Share button title" = "Kongsi";

"Shared Photos|Title for section showing photos in a thread (count will follow)" = "Gambar Perkongsian";

"Shared a link|text for a link share" = "Berkongsi pautan";

"Shared a photo|text for a photo share" = "Berkongsi foto";

"Shared a video|text for a video share" = "Berkongsi video";

"Show keyboard|Accessibility label for sticker button in the input field when sticker input is shown" = "Tunjukkan papan kekunci";

"Show stickers|Accessibility label for sticker button in the input field when sticker input is not shown" = "Tunjukkan pelekat";

"Sign Up for Facebook|Sign Up - Sign Up Button Title" = "Daftar untuk Facebook";

"Skip|Skip - Skip Button Title" = "Langkau";

"Something went wrong. Want to try again?|retry dialog message" = "Sesuatu masalah telah berlaku. Ingin mencuba semula?";

"Sorry, something went wrong|Generic error message for Web browser errors" = "Maaf, suatu masalah telah berlaku";

"Standard Data Charges|Alert title that warns users their mobile carrier may charge them to use this feature" = "Caj Data Standard";

"Standard charges apply when you load map data.|Alert message that warns users their mobile carrier may charge them for loading the map location" = "Caj standard digunakan apabila anda memuatkan data peta.";

"Start Group Chats|Call to action for Group Chat NUX slide" = "Mulakan Sembang Kumpulan";

"Sticker Store|Navigation bar title for sticker store view" = "Stor Pelekat";

"Stop attaching media|Accessibility text for button that lets user stop attaching photos or other media, as well as emoticons and emoji" = "Berhenti melampirkan media";

"Submit|Submit button title" = "Hantar";

"Suggestions|Suggested people to send a message to" = "Cadangan";

"Switch Account|text for switching logged in user" = "Tukar Akaun";

"Switch to Wi-Fi to complete your call|Error case when calls not allowed over cellular data. Suggest user switch to WiFi instead." = "Tukar kepada Wi-Fi untuk melengkapkan panggilan anda";

"Sync Contacts|Start contact sync button label, 15 char max" = "Segerakkan Kenalan";

"Sync Your Contacts|Title of the Learn More screen for the contact sync feature" = "Segerakkan Kenalan Anda";

"Tag posts and photos with a location. Plus discover what's happening nearby, even when your phone is in your pocket.|Description of NUX to encourage user to use location services." = "Tanda kiriman dan gambar dengan lokasi. Tambahan lagi ketahui apa yang berlaku berdekatan, walaupun telefon anda berada di dalam poket anda.";

"Take Photo|action sheet option for taking a photo" = "Ambil Foto";

"Tap General|One of a sequence of steps instructing user to turn on location services." = "Ketik Am";

"Tap Location Services|One of a sequence of steps instructing user to turn on location services." = "Ketik Perkhidmatan Lokasi";

"Tap Privacy|One of a sequence of steps instructing user to turn on location services." = "Ketik Privasi";

"Tap \"Try Again\" to send this message.|prompt for how to resend a failed message send" = "Ketik \"Cuba Lagi\" untuk menghantar mesej ini.";

"Tap gear to turn on chat|placeholder in search bar when offline" = "Ketik gear untuk hidupkan perbualan";

"Tap here to learn about your settings and why Facebook continuously needs your location.|Disclaimer text for continuous location tracking and sharing feature" = "Ketik sini untuk pelajari tentang tetapan anda dan mengapa Facebook memerlukan lokasi anda secara berterusan.";

"Tap the + to send photos, add s and record voice messages.|Text for Media attachment NUX" = "Ketik + untuk menghantar foto, tambah s dan rakan mesej suara.";

"Tap to return to call|Message shown on in-call bar explaining that the user may tap on it to return to the call screen" = "Ketik untuk kembali ke panggilan";

"Tap to turn on location|Title of location NUX when user has disabled location services." = "Ketik untuk hidupkan lokasi";

"Text messages can't be sent to that number.|Error reported when a phone number with an unsupported mobile carrier is on the recipients list of a message." = "Mesej teks tidak dapat dihantar ke nombor tersebut.";

"Text your friends for free.|The detailed info for free messenger promotion" = "Hantarkan teks kepada rakan anda secara percuma.";

"Text your friends wherever they are - on their phones or on chat.|The description message to promote users for installing Facebook Messenger app" = "Menghantar teks kepada rakan anda di mana sahaja mereka berada - pada telefon mereka atau dalam perbualan.";

"That phone number is not allowed to receive text messages.|Error reported when an unlaunched phone number is on the recipients list of a message." = "Nombor telefon itu tidak dibenarkan menerima mesej teks.";

"There was a problem connecting to Facebook. Please check your connection and try again.|error message for failing to connect to Facebook" = "Terdapat masalah bersambung kepada Facebook. Sila semak sambungan anda dan cuba lagi.";

"There was a problem connecting your call. Please connect to Wi-Fi and try again.|Alert body message when connection failed suggesting user switch to wifi" = "Terdapat masalah semasa menyambungkan panggilan anda. Sila sambung ke Wi-Fi dan cuba lagi.";

"Tip: Never Miss a Message|Title for reminder to turn on push notifications" = "Petua: Jangan Terlepas Mesej";

"To accept calls, you need to update to the new version of Messenger.|Error dialog body shown when an incoming call failed because the current version is outdated" = "Untuk menerima panggilan, anda perlu mengemas kini kepada versi baru Messenger.";

"To complete your phone number activation, please enter the activation code|" = "Untuk melengkapkan pengaktifan nombor telefon anda, sila masukkan kod pengaktifan";

"To include location with your messages, go to your %@.|Alert dialog instructing the user how to re-enable location permission. The variable is 'Settings App > Location Services' or 'Settings App > General > Location Services'" = "Untuk memasukkan lokasi dengan mesej anda, pergi ke %1$@ anda.";

"To make calls, you need to update to the new version of Messenger.|Error dialog body. Shown when a user attempts to make a VoIP call but their version is incompatible." = "Untuk membuat panggilan, anda perlu mengemas kini kepada versi baru Messenger.";

"To turn off alerts for this conversation, go to conversation settings.|User education for how to configure conversation alerts" = "Untuk mematikan notifikasi untuk perbualan ini, pergi ke tetapan perbualan.";

"To turn off location for all your conversations, go to your %@.|Text of location NUX when user turns off location services for the first time. The parameter is the location of the Location Services in the Settings app (ie. Settings App > Location Services)" = "Untuk mematikan lokasi bagi semua perbualan anda, pergi ke %1$@ anda.";

"To turn on notifications, visit iPhone Settings %@ Notifications %@ Messenger|Body of dialog telling the user how to enable push notifications on Messenger" = "Untuk menghidupkan makluman, lawati Tetapan iPhone %1$@ Makluman %2$@ Messenger";

"To use this feature, go to your %@ settings and choose Location Services. Select ON for %@.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "Untuk menggunakan ciri ini, pergi ke tetapan %1$@ anda dan pilih Perkhidmatan Lokasi. Pilih ON untuk %2$@.";

"To use this feature, go to your %@ settings and tap Privacy, then Location Services. Select ON for %@.|Error explanation when location services are unavailable. {name1} is the name of the current device, e.g. iPhone; {name2} is the app name." = "Untuk menggunakan ciri ini, pergi ke tetapan %1$@ dan ketik Privasi, kemudian Perkhidmatan Lokasi. Pilih ON untuk %2$@.";

"To|Accessibility label for to field in contact picker" = "Kepada";

"To:|to field in contact picker" = "Kepada:";

"Touch and hold to talk.\nRelease to send, or slide off the button to cancel.|Instruction text for holding voice record button, letting go to send, and dragging finger off to cancel message" = "Sentuh dan tahan untuk bercakap.\nLepaskan untuk hantar, atau luncurkan butang untuk batal.";

"Try Again|button text for resending an unsent message. this is referred to in the prompt Tap \"Try Again\" text" = "Cuba Lagi";

"Turn Off Chat|Button title to let the user change their chat status from online to offline" = "Matikan Perbualan";

"Turn Off Until 8am|Option to turn off alerts until 8am" = "Matikan Hingga 8 pagi";

"Turn Off for 1h|Option to turn off alerts for 1 hour" = "Matikan selama 1 jam";

"Turn Off|Option to turn off alerts" = "Matikan";

"Turn On Chat|Button title to let the user change their chat status from offline to online" = "Hidupkan Perbualan";

"Turn On Location Services|Error message title when location services are unavailable." = "Buka Perkhidmatan Lokasi";

"Turn On Notifications|Call to action in NUX encouraging user to turn on push notifications" = "Matikan Pemberitahuan";

"Turn On Notifications|Title of dialog telling the user how to enable push notifications" = "Hidupkan Makluman";

"Turn On|Option to turn on alerts" = "Hidupkan";

"Turn On|Turn on alerts" = "Hidupkan";

"Turn On|button label for deferring enabling push notifications" = "Hidupkan";

"Turn on Push Notifications|Call to action for Push Notification NUX slide" = "Hidupkan Laporan Push";

"Turn on push notifications to find out when new messages arrive.|Message for reminder to turn on push notifications" = "Hidupkan pemberitahuan push untuk mengetahui masa mesej baru sampai.";

"Turns notifications on or off|Accessibility hint for Notification switch in the messenger settings panel, which lets users to turn on/off notifications" = "Hidupkan atau matikan pemberitahuan";

"Typing…|Text for when the other user is typing. Ends with an ellipsis (U+2026) and is lower-case." = "Menaip…";

"Unable to Call %@|Error dialog title. Shown when app must be updated" = "Tidak dapat Memanggil %1$@";

"Unable to Save Image|retry dialog title for setting thread image" = "Gagal Menyimpan Imej";

"Unable to Send|Title for send feedback failed warning." = "Tidak Dapat Menghantar";

"Unable to add more people to the conversation. Please try again.|error message for failing to add people" = "Gagal untuk menambah lebih ramai orang ke perbualan. Sila cuba lagi.";

"Unable to name your conversation.|error message after setting conversation name" = "Gagal menamakan perbualan anda.";

"Unable to remove you right now.|error messages after leaving conversation" = "Gagal mengeluarkan anda pada masa ini.";

"Unable to save messaging favorites to Facebook|error message for failing to save messaging favorites" = "Gagal menyimpan kegemaran mesej ke Facebook";

"Unable to send message. Retry?|Alert text for when a message failed to send that also asks user to retry." = "Gagal menghantar mesej. Cuba semula?";

"Unable to send message.|Alert text for when a message failed to send." = "Gagal menghantar mesej.";

"Unable to send right now.|error message for failing to send message" = "Gagal dihantar pada masa ini.";

"Unpin|button title to remove user from favorites" = "Buka pin";

"Update|Get new version now button." = "Kemas kini";

"Updating...|updating progress text" = "Mengemas kini...";

"Upgrade Now|button text on alert dialog prompting user to upgrade app" = "Naik Taraf Sekarang";

"Use Messenger for Free|Default title for the zero rating promotion banner view at the bottom of screen." = "Guna Messenger secara Percuma";

"View Call|Text show on button that views an incoming call" = "Lihat Panggilan";

"View Missed Call|Text show on button that views an incoming call" = "Lihat Panggilan Terlepas";

"View Timeline|Button text to go to a user's timeline" = "Lihat Garis Masa";

"View in Maps|action sheet option for viewing a map" = "Lihat dalam Peta";

"View|Alert button that takes user to the thread where a message failed to send" = "Lihat";

"We are sorry that the %@ sticker pack has failed to download, please try again later.|Description text shown in alert when downloading a sticker pack has failed" = "Maafkan kami kerana pek pelekat %1$@ gagal dimuat turun, sila cuba sebentar lagi.";

"We'll text you a link to confirm your number.|Confirmation information text" = "Kami akan sms pautan kepada anda untuk tujuan pengesahan nombor telefon anda.";

"Welcome to Messenger|Title for NUX page" = "Selamat Datang ke Messenger";

"Who do you want to message?|Placeholder text in To field when composing a message" = "Siapa yang anda ingin hantarkan mesej";

"Who would you like to send this message to?|dialog message for when user tries to send message to no recipients" = "Kepada siapa anda hendak menghantar mesej ini?";

"Write a blast (sends a separate message to each friend)|Placeholder text for blast message text box which helps explain how blast messages work." = "Tulis mesej sebaran (menghantar mesej berasingan kepada setiap rakan)";

"Write a broadcast (sends a separate message to each friend)|Placeholder text for broadcast message text box which helps explain how broadcast messages work." = "Tulis mesej siaran (menghantar mesej berasingan kepada setiap rakan)";

"Write a message...|Placeholder text to suggest writing a message" = "Tulis mesej...";

"You can call %@ over Wi-Fi. Please turn on Wi-Fi in your phone settings.|Error message when user tries to initiate a call if wifi is required" = "Anda boleh memanggil %1$@ melalui Wi-Fi. Sila hidupkan Wi-Fi dalam seting telefon anda.";

"You can manage your data in your privacy settings.|Explanation to let user know he can manage his data in privacy settings." = "Anda boleh menguruskan data anda dalam tetapan privasi anda.";

"You missed a call from %@|Message notifying user of a missed call from Friend" = "Anda terlepas panggilan daripada %1$@";

"You will get an SMS or email shortly with a code to use for logging in.|message in login approval dialog" = "Anda akan menerima SMS atau e-mel seketika nanti dengan kod untuk digunakan bagi mengelog masuk.";

"You won't find out when you've received a message.|Body of dialog encouraging the user to enable push notifications" = "Anda tidak akan tahu apabila anda telah menerima mesej.";

"You|String for you, the user" = "Anda";

"You're about to leave Messenger. Standard data charges may apply.|Alert message that warns users their mobile carrier may charge them due to redirect out of Messenger" = "Anda sedang meninggalkan Messenger. Caj data standard mungkin digunakan.";

"Your Stickers|Segment button label for downloaded stickers" = "Pelekat Anda";

"Your friend can't receive calls right now|Text informing user that call button is disabled because his or her friend is not available" = "Rakan anda tidak dapat menerima panggilan buat masa ini.";

"Your friend is nearby at a coffee shop.|Example of what user can know after sharing location." = "Rakan anda berada di kedai kopi berhampiran.";

"Your friend recommended a restaurant nearby.|Example of what user can know after sharing location." = "Rakan anda menyarankan sebuah restoran yang berhampiran.";

"Your friend took a photo nearby.|Example of what user can know after sharing location." = "Rakan anda mengambil foto berhampiran sini.";

"Your message failed to send to one or more of the recipients.|dialog content for when a broadcast message fails." = "Mesej anda gagal dihantar kepada satu atau lebih penerima.";

"Your message failed to send to one or more of the recipients.\n\n%@|dialog content for when a broadcast message fails, appended with a localized server error message. The server error message should appear on its own line and will generally be its own sentence, such as 'The internet connection appears to be offline.'" = "Mesej anda gagal dihantar kepada satu atau lebih penerima.\n\n%1$@";

"Your message was not sent.|text shown when a message failed to send" = "Mesej anda tidak dihantar.";

"Your messages were not sent.|text shown when more than 1 message failed to send" = "Mesej anda tidak dihantar.";

"[[content]] [[cta]]|The i18n format for zero rating banner" = "[[content]] [[cta]]";

"·|Dot separator between title and count label" = ".";

"…|Ellipsis (U+2026) used to represent a chat message that is currently being written" = "...";

"active 1d ago|indicator that a user was active 1 day ago" = "aktif 1hr yang lalu";

"active 1h ago|indicator that a user was active 1 hour ago" = "aktif 1 jam yang lalu";

"active 1m ago|indicator that a user was active 1 minute ago" = "aktif 1 min yang lalu";

"active now|indicator that a user is currently active, on web or mobile" = "aktif sekarang";

"active on mobile %@ ago|presences status for being active on mobile a relative time ago" = "aktif pada mudah alih %1$@ lalu";

"active on mobile|presences status for being active on mobile" = "aktif pada mudah alih";

"active %id ago|indicator that a user was active 2+ days ago" = "aktif %1$ihr yang lalu";

"active %ih ago|indicator that a user was active 2+ hours ago" = "aktif %1$i jam yang lalu";

"active %im ago|indicator that a user was active 2+ minute ago" = "aktif %1$i min yang lalu";

"active %@ ago|presences status for being active a relative time ago" = "aktif  %1$@ lalu";

"error|A short message for audio play error" = "ralat";

"is calling|text below the caller's name when they are calling" = "sedang memanggil";

"is typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "sedang menaip…";

"on mobile|presences status for being available on mobile" = "pada mudah alih";

"online %@ ago|presences status for being online on the web a relative time ago" = "dalam talian %1$@ lalu";

"online|presences status for being online on the web" = "dalam talian";

"typing…|text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case." = "menaip…";

"%d more friends nearby...|Additional nearby friend results available to show" = "%1$d rakan lagi berhampiran...";

"%d of %d|Title on photo viewer screen showing which photo is currently displayed. eg. 2 of 3" = "%1$d daripada %2$d";

"%i days|text to show user was online/active N days ago (don't abbrev)" = "%1$i hari";

"%i hours|text to show user was online/active N hours ago (don't abbrev)" = "%1$i jam";

"%i minutes|text to show user was online/active N minutes ago (don't abbrev)" = "%1$i minit";

"%i people found, %i matched|Explanation of how many contacts have been imported" = "%1$i orang dijumpai, %2$i dipadankan";

"%id|short indicator that a user was active 2+ days ago" = "%1$ih";

"%ih|short indicator that a user was active 2+ hours ago" = "%1$ij";

"%im|short indicator that a user was active 2+ minute ago" = "%1$im";

"%@  •  %@|Seen state text for a user in a group detail page. eg. (name <bullet-character> time)" = "%1$@ • %2$@";

"%@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ dan %2$@ menggunakan Facebook Messenger";

"%@ and %@|String for two user names who are participants on a thread" = "%1$@ dan %2$@";

"%@ hundred-million|Shortened number whose value is larger than 100,000,000. Only used in languages that have a word for 'hundred million' but not for 'billion'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@ ratus juta";

"%@ is calling|Message notifying of an incoming call. First parameter is the name of the caller" = "%1$@ sedang memanggil";

"%@ is in another call|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ berada dalam panggilan lain";

"%@ is nearby at a coffee shop.|Example of what user can know after sharing location. E.g. Mark is nearby at a coffee shop." = "%1$@ berada di kedai kopi berhampiran.";

"%@ is not available|End call message notifying caller that callee is unavailable. First parameter is the name of the callee" = "%1$@ tidak tersedia";

"%@ is on messenger|Accessibility label for a profile photo showing the user that one of their friends uses Messenger" = "%1$@ ada pada messenger";

"%@ is typing…|string format text for when the other user is typing. ends with an ellipsis (U+2026) and is lower-case. name appears on left" = "%1$@ sedang menaip…";

"%@ recommended a restaurant nearby.|Example of what user can know after sharing location. E.g. Linda recommended a restaurant nearby." = "%1$@ menyarankan sebuah restoran yang berhampiran.";

"%@ said %@|Accessibility label for a message, will be announced to blind users. First placeholder is for sender name, second placeholder is for the message he/she sent." = "%1$@ menyatakan %2$@";

"%@ ten-thousand|Shortened number whose value is between 10,000 and 99,999,999. Only used for languages that have a word for 'ten thousand' but not for 'million'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@ puluh ribu";

"%@ took a photo nearby.|Example of what user can know after sharing location. E.g. Anna took a photo nearby." = "%1$@ mengambil foto berhampiran sini.";

"%@ tried to call you|Error dialog title shown when an incoming voice call can't be received" = "%1$@ cuba memanggil anda";

"%@ uses Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@ menggunakan Facebook Messenger";

"%@|Name of a person (used both standalone and in lists). Add honorifics (-san, etc.) if appropriate." = "%1$@";

"%@, %d new messages|new messages input format" = "%1$@, %2$d mesej baru";

"%@, %i more|List of user names and X more if the list is truncated at N names." = "%1$@, %2$i lagi";

"%@, %@ and %@ use Facebook Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@ dan %3$@ menggunakan Facebook Messenger";

"%@, %@, %@ and 1 other friend use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ dan 1 rakan lain menggunakan Messenger";

"%@, %@, %@ and %i other friends use Messenger|Upsell message for promoting Facebook Messenger. It shows how many your friends are already using Messenger" = "%1$@, %2$@, %3$@ dan %4$i rakan lain menggunakan Messenger";

"%@: %@|Localized contact label: phone number (note colon separator)" = "%1$@: %2$@";

"%@B|Shortened number whose value is larger than 1,000,000,000. B stands for 'billion'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@B";

"%@K|Shortened number whose value is between 1,000 and 999,999. K stands for 'thousand''. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@K";

"%@M|Shortened number whose value is between 1,000,000 and 999,999,999. M stands for 'mega' or 'million'. {name1}: a whole number or a fraction up to one decimal place (e.g. 17 or 17.1)" = "%1$@M";

"%@…|a string that has been shortened adding ellipsis (unicode 2026)" = "%1$@...";

"%u Friends Nearby|Title of mini-megaphone inside chat bar. E.g. 5 Friends Nearby" = "%1$u Rakan Berdekatan";

"%u of your friends are sharing their location with you.|Message to let user know how many of his friends are sharing location." = "%1$u rakan anda sedang berkongsi lokasi mereka dengan anda.";

"%u photo attached|Accessiblity text for a single photo" = "%1$u foto dilampirkan";

"%u photos attached|Accessibility text for a photo set" = "%1$u gambar dilampirkan";

